// 03.js - 산술 연산자
// -----------------------------------------------------------
//  산술 연산자
// - 수학적인 계산에 사용
// -----------------------------------------------------------
// + : 덧셈
// - : 뺄셈
// * : 곱셈
// / : 나눗셈
// % : 나머지
// ** : 거듭제곱 (ES7)
// -----------------------------------------------------------

console.log(10 + 5); // 15
console.log(10 - 5); // 5
console.log(10 * 5); // 50
console.log(10 / 5); // 2
console.log(10 % 5); // 0
console.log(10 ** 2); // 100

// 연산자 우선순위
console.log(2 + 5 * 2); // 12
console.log((2 + 5) * 2); // 14

// 부동소수점 문제
console.log(0.1 + 0.9); // 1
console.log(0.1 + 0.2); // 0.30000000000000004 (이진수 오차)

// 해결 방법 → Decimal.js 같은 외부 라이브러리
console.log((0.1 * 100000000 + 0.2 * 100000000) / 100000000); // 0.3
